InformationRegisters/НастройкиПодключенияГуглСервисов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПодключенияГуглСервисов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидНастройки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНастроекГуглСервисов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВариантыНастроекГуглСервисов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВариантыНастроекГуглСервисов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ClientID</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ClientSecret</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>code</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>access_token</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>refresh_token</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаПолученияТокена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>expires_in</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/НастройкиПодключенияГуглСервисов/Ext/ManagerModule.bsl
Процедура ЗаписатьЗначениеНастройки(КлючНастройки, ЗначениеНастройки) Экспорт
	
	Запись = РегистрыСведений.НастройкиПодключенияГуглСервисов.СоздатьМенеджерЗаписи();
	Запись.ВидНастройки = КлючНастройки;
	Запись.Значение = ЗначениеНастройки;
	Запись.Записать();
	
КонецПроцедуры

Процедура ЗаписатьЗначениеНастроек(СтруктураНастроек) Экспорт
	
	Для Каждого Настройка Из СтруктураНастроек Цикл
		
		Запись = РегистрыСведений.НастройкиПодключенияГуглСервисов.СоздатьМенеджерЗаписи();
		Запись.ВидНастройки = Перечисления.ВариантыНастроекГуглСервисов[Настройка.Ключ];
		Запись.Значение = Настройка.Значение;
		Запись.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСписокНастроек() Экспорт
	
	СписокНастроек = Новый Соответствие;
	
	Для Каждого ЗначениеПеречисления Из Метаданные.Перечисления.ВариантыНастроекГуглСервисов.ЗначенияПеречисления Цикл
		
		 СписокНастроек.Вставить(Перечисления.ВариантыНастроекГуглСервисов[ЗначениеПеречисления.Имя], "");
		
	КонецЦикла;
	
	НаборЗаписей = РегистрыСведений.НастройкиПодключенияГуглСервисов.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Для Каждого ТекущаяЗапись Из НаборЗаписей Цикл
		СписокНастроек.Вставить(ТекущаяЗапись.ВидНастройки, ТекущаяЗапись.Значение);
	КонецЦикла;
	
	Возврат СписокНастроек;
	
КонецФункции

Функция ПолучитьТокен() Экспорт
	
	СписокНастроек = ПолучитьСписокНастроек();
	
	Если СписокНастроек[Перечисления.ВариантыНастроекГуглСервисов.ДатаПолученияТокена] + 
		СписокНастроек[Перечисления.ВариантыНастроекГуглСервисов.expires_in] < ТекущаяДата() + 60 Тогда
		
		Токен = ИнтеграцияСГуглСервисамиСЗ.POSTЗапрос_ОбновитьТокен();
		
	Иначе
		
		Токен = СписокНастроек[Перечисления.ВариантыНастроекГуглСервисов.access_token];
		
	КонецЕсли;
	
	Возврат Токен;
		
КонецФункции
